БИТУправление_медицинским_центром_демо/src/InformationRegisters/ПараметрыПродажПоСтраховымПрограммам/ПараметрыПродажПоСтраховымПрограммам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыПродажПоСтраховымПрограммам</name>
  <resources>
    <name>Диагноз</name>
    <type>
      <types>CatalogRef.Диагнозы</types>
    </type>
  </resources>
  <resources>
    <name>Зуб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СегментЗуба</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Проверено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОпределенияПриема</name>
    <type>
      <types>EnumRef.СпособыОпределенияПриемаДляПродажПоСтраховымПрограммам</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОпределенияДиагноза</name>
    <type>
      <types>EnumRef.СпособыОпределенияДиагнозаДляПродажПоСтраховымПрограммам</types>
    </type>
  </attributes>
  <attributes>
    <name>Прием</name>
    <type>
      <types>DocumentRef.Прием</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ВидыСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <comment>Врач</comment>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ОказаниеУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяТЧ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/СпособыОпределенияДиагнозаДляПродажПоСтраховымПрограммам/СпособыОпределенияДиагнозаДляПродажПоСтраховымПрограммам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОпределенияДиагнозаДляПродажПоСтраховымПрограммам</name>
  <enumValues>
    <name>УказанПользователем</name>
  </enumValues>
  <enumValues>
    <name>ЕдинственныйВПриеме</name>
  </enumValues>
  <enumValues>
    <name>ОстрейшийВПриеме</name>
  </enumValues>
  <enumValues>
    <name>ОстрейшийВПриемеИНаиболееОсновной</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/СпособыОпределенияПриемаДляПродажПоСтраховымПрограммам/СпособыОпределенияПриемаДляПродажПоСтраховымПрограммам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОпределенияПриемаДляПродажПоСтраховымПрограммам</name>
  <enumValues>
    <name>УказанПользователем</name>
  </enumValues>
  <enumValues>
    <name>ПоОбщейЗаявке</name>
  </enumValues>
  <enumValues>
    <name>ПоДатеПосещения</name>
  </enumValues>
  <enumValues>
    <name>ПоПриемамПоследнихДней</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ПараметрыПродажПоСтраховымПрограммам/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МетаданныеОбработки = Метаданные.Обработки.СтраховыеПрограммыЗаполнениеПараметровРеестра;
	Если Не ПравоДоступа("Просмотр", Метаданные.Обработки.СтраховыеПрограммыЗаполнениеПараметровРеестра.Команды.ОткрытьОбработку) Тогда
		
		МетаданныеРегистра = Метаданные.РегистрыСведений.ПараметрыПродажПоСтраховымПрограммам;
		Для Каждого Реквизит Из МетаданныеРегистра.Реквизиты Цикл
			ЭлементФормы = Элементы.Найти(Реквизит.Имя);
			Если ЭлементФормы <> Неопределено Тогда
				ЭлементФормы.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДиагнозПриИзменении(Элемент)
	Запись.СпособОпределенияДиагноза = ПредопределенноеЗначение("Перечисление.СпособыОпределенияДиагнозаДляПродажПоСтраховымПрограммам.УказанПользователем");
КонецПроцедуры

&НаКлиенте
Процедура ПриемПриИзменении(Элемент)
	Запись.СпособОпределенияПриема = ПредопределенноеЗначение("Перечисление.СпособыОпределенияПриемаДляПродажПоСтраховымПрограммам.УказанПользователем");
КонецПроцедуры

#КонецОбласти
